Repository: eurolinux-enterprise-linux-sources/fwupd
Catalog: src/po/*.po
Languages: cs, ru

source: Update device firmware on Linux
cs: Aktualizace firmwaru zařízení na Linuxu
ru: Обновить микропрограмму устройства на Linux

source: This project aims to make updating firmware on Linux automatic, safe and reliable. You can either use a GUI software manager like GNOME Software to view and apply updates, the command-line tool or the D-Bus interface directly.
cs: Cílem tohoto projektu je učinit aktualizaci firmwaru na Linuxu automatickou, bezpečnou a spolehlivou. Pro zobrazení a aplikaci aktualizací můžete použít GUI správce softwaru typu GNOME Software, nástroj pro příkazovou řádku nebo přímo D-Bus.

source: The fwupd process is a simple daemon to allow session software to update device firmware on your local machine. It is designed for desktops, but this project is also usable on phones, tablets and on headless servers.
cs: Proces fwupd je jednoduchý démon, který umožňuje softwaru sezení aktualizovat firmware zařízení na vašem počítači. Je navržen pro stolní počítače, ale je možno jej použít také na telefonech, tabletech a serverech bez monitoru.

source: Install signed system firmware
cs: Instalace podepsaného systémového firmwaru
ru: Установить подписанную системную микропрограмму

source: Authentication is required to update the firmware on this machine
cs: K aktualizaci firmwaru na tomto počítači je vyžadováno ověření
ru: Для обновления микропрограммы на этой машине требуется аутентификация

source: Install unsigned system firmware
cs: Instalace nepodepsaného systémového firmwaru
ru: Установить неподписанную системную микропрограмму

source: Install old version of system firmware
cs: Instalace starší verze systémového firmwaru
ru: Установить старую версию системной микропрограммы

source: Authentication is required to downgrade the firmware on this machine
cs: K ponížení verze firmwaru na tomto počítači je vyžadováno ověření
ru: Для понижения версии микропрограммы на этой машине требуется аутентификация

source: Install signed device firmware
cs: Instalace podepsaného firmwaru zařízení
ru: Установить подписанную микропрограмму устройства

source: Authentication is required to update the firmware on a removable device
cs: K aktualizaci firmwaru na výměnném zařízení je vyžadováno ověření
ru: Для обновления микропрограммы на съёмном устройстве требуется аутентификация

source: Install unsigned device firmware
cs: Instalace nepodepsaného firmwaru zařízení
ru: Установить неподписанную микропрограмму устройства

source: Authentication is required to downgrade the firmware on a removable device
cs: K ponížení verze firmwaru na výměnném zařízení je vyžadováno ověření
ru: Для понижения версии микропрограммы на съёмном устройстве требуется аутентификация

source: Unlock the device to allow access
cs: Odemknutí zařízení pro umožnění přístupu
ru: Разблокировать устройство для получения доступа

source: Authentication is required to unlock a device
cs: Pro odemknutí zařízení je požadováno ověření
ru: Для разблокировки устройства требуется аутентификация

source: Update the stored device verification information
cs: Aktualizace uložené informace o ověření zařízení
ru: Обновление хранимой проверочной информации устройства

source: Authentication is required to update the stored checksums for the device
cs: K aktualizaci uložených kontrolních součtů zařízení je vyžadováno ověření
ru: Для обновления хранимых контрольных сумм устройства требуется аутентификация

source: Modify a configured remote
cs: Upravit nastavený vzdálený zdroj

source: Authentication is required to modify a configured remote used for firmware updates
cs: K úpravě nastaveného vzdáleného zdroje používaného pro aktualizace firmwaru je vyžadováno ověření

source: Alias to %s
cs: Alias pro %s
ru: Псевдоним %s

source: Command not found
cs: Příkaz nebyl nalezen
ru: Команда не найдена

source: Added
cs: Přidáno
ru: Добавлено

source: Removed
cs: Odebráno
ru: Удалено

source: Changed
cs: Změněno
ru: Изменено

source: Cancelled
cs: Zrušeno
ru: Отменено

source: Name
cs: Název
ru: Наименование

source: Cipher
cs: Šifra
ru: Шифр

source: Region
cs: Oblast
ru: Регион

source: Found
cs: Nalezeno
ru: Найдено

source: Protocol
cs: Protokol
ru: Протокол

source: Status
cs: Stav
ru: Статус

source: Serial
cs: Sériové číslo
ru: Порядковое

source: Mode
cs: Režim
ru: Режим

source: State
cs: Stav
ru: Состояние

source: Transfer Size
cs: Přenášená velikost
ru: Размер передачи

source: Quirks
cs: Zvláštní požadavky
ru: Проблемы

source: Convert firmware to DFU format
cs: Převést firmware do formátu DFU
ru: Преобразовать микропрограмму в формат DFU

source: Merge multiple firmware files into one
cs: Sloučit více firmwarů do jednoho
ru: Объединить несколько файлов микропрограмм в один

source: Set vendor ID on firmware file
cs: Nastavit ID výrobce v souboru s firmwarem
ru: Установить идентификатор производителя для файла микропрограммы

source: Set product ID on firmware file
cs: Nastavit ID produktu v souboru s firmwarem
ru: Установить идентификатор продукта для файла микропрограммы

source: Set element address on firmware file
cs: Nastavit adresu prvku na firmwaru zařízení
ru: Установить адрес элемента для файла микропрограммы

source: Set the firmware size for the target
cs: Nastavit velikost firmwaru pro cíl
ru: Установить размер микропрограммы для конечного объекта

source: Set release version on firmware file
cs: Nastavit verzi vydání v souboru s firmwarem
ru: Установить версию выпуска для файла микропрограммы

source: Set alternative number on firmware file
cs: Nastavit alternativní číslo v souboru s firmwarem
ru: Установить альтернативный номер для файла микропрограммы

source: Set alternative name on firmware file
cs: Nastavit alternativní název v souboru s firmwarem
ru: Установить альтернативное наименование для файла микропрограммы

source: Attach DFU capable device back to runtime
cs: Napojit zařízení podporující DFU zpět do běhového režimu
ru: Вернуть устройство с возможностями DFU к использованию

source: Read firmware from device into a file
cs: Přečíst firmware ze zařízení do souboru
ru: Считать микропрограмму из устройства файл

source: Read firmware from one partition into a file
cs: Přečíst firmware z jednoho oddílu do souboru
ru: Считать микропрограмму из одного раздела в файл

source: Write firmware from file into device
cs: Zapsat firmware ze souboru do zařízení
ru: Записать микропрограмму из файла на устройство

source: Write firmware from file into one partition
cs: Zapsat firmware ze souboru do jednoho oddílu
ru: Записать микропрограмму из файла на один раздел

source: List currently attached DFU capable devices
cs: Vypsat právě napojená zařízení podporující DFU
ru: Вывести список подсоединённых сейчас устройств с возможностями DFU

source: Detach currently attached DFU capable device
cs: Odpojit aktuálně napojené zařízení podporující DFU
ru: Отсоединить подсоединённое сейчас устройство с возможностями DFU

source: Dump details about a firmware file
cs: Vypsat podrobnosti o souboru s firmwarem
ru: Создать дамп данных по файлу микропрограммы

source: Watch DFU devices being hotplugged
cs: Sledovat připojení zařízení podporujících DFU
ru: Наблюдать за устройствами DFU, которые являются подключёнными

source: Encrypt firmware data
cs: Zašifrovat data firmwaru
ru: Зашифровать данные микропрограммы

source: Decrypt firmware data
cs: Dešifrovat data firmwaru
ru: Расшифровать данные микропрограммы

source: Sets metadata on a firmware file
cs: Nastavit metadata v souboru s firmwarem
ru: Устанавливает метаданные файла микропрограммы

source: Replace data in an existing firmware file
cs: Nahradit data v existujícím souboru s firmwarem
ru: Заменить данные в существующем файле микропрограммы

source: Create a binary patch using two files
cs: Vytvořit binární záplatu za použití dvou souborů

source: Apply a binary patch
cs: Použít binární záplatu

source: Dump information about a binary patch to the screen
cs: Vypsat na obrazovku informace o binární záplatě

source: DFU Utility
cs: Nástroj pro práci s DFU
ru: Средство работы с DFU

source: Failed to parse arguments
cs: Selhalo zpracování argumentů
ru: Не удалось разобрать аргументы

source: Enumerate all Synaptics MST devices
cs: Enumerovat všechny zařízení Synaptics MST
ru: Перечислить все устройства Synaptics MST

source: Flash firmware file to MST device
cs: Zapsat soubor firmwaru do zařízení MST
ru: Записать файл микропрограммы на устройство MST

source: Installing firmware update…
cs: Instaluje se aktualizace firmwaru…
ru: Установка обновления микропрограммы...

source: Show debugging information for all files
cs: Zobrazovat ladicí informace pro všechny soubory
ru: Показать отладочную информацию для всех файлов

source: Debugging Options
cs: Volby ladění
ru: Параметры отладки

source: Show debugging options
cs: Zobrazit volby ladění
ru: Показать параметры отладки

source: Exit after a small delay
cs: Skončit po krátké prodlevě
ru: Выйти после небольшой задержки

source: Exit after the engine has loaded
cs: Skončit po načtení výkonné části
ru: Выйти после загрузки движка

source: Firmware Update Daemon
cs: Démon pro aktualizaci firmwaru
ru: Служба обновления микропрограммы

source: Firmware Update D-Bus Service
cs: Služba D-Bus pro aktualizaci firmwaru
ru: D-Bus служба обновления микропрограммы

source: Idle…
cs: Nečinný…
ru: Бездействие…

source: Decompressing…
cs: Rozbaluje se firmware…
ru: Распаковка…

source: Loading…
cs: Načítá se…
ru: Загрузка…

source: Restarting device…
cs: Zařízení se restartuje…
ru: Перезапуск устройства…

source: Reading…
cs: Čte se…

source: Writing…
cs: Zapisuje se…
ru: Запись…

source: Erasing…
cs: Maže se…

source: Verifying…
cs: Ověřuje se…
ru: Проверка…

source: Scheduling…
cs: Plánuje se…
ru: Планировка…

source: Downloading…
cs: Stahuje se…
ru: Получение...

source: Authenticating…
cs: Ověřuje se…

source: Unknown
cs: Neznámý
ru: Неизвестно

source: Please enter a number from 1 to %u:
cs: Zadejte prosím číslo od 1 do %u:
ru: Введите число от 1 до %u:

source: Choose a device:
cs: Vyberte zařízení:
ru: Выберите устройство:

source: No hardware detected with firmware update capability
cs: Nebylo nalezeno žádné zařízení schopné aktualizace firmwaru
ru: Не обнаружено оборудования с возможностью обновления микропрограммы

source: Reinstalling %s with %s...
cs: Přeinstalovává se %s na %s…
ru: Переустановка %s с %s…

source: Downgrading %s from %s to %s...
cs: Ponižuje se %s z verze %s na %s…
ru: Понижение версии %s с %s на %s…

source: Updating %s from %s to %s...
cs: Aktualizuje se %s z verze %s na %s…
ru: Обновление %s с %s на %s…

source: Done!
cs: Hotovo!
ru: Готово!

source: OK
cs: V pořádku
ru: ОК

source: Fetching signature
cs: Stahuje se podpis
ru: Получение подписи

source: Fetching metadata
cs: Stahují se metadata
ru: Получение метаданных

source: Fetching firmware
cs: Stahuje se firmware
ru: Получение микропрограммы

source: Fetching file
cs: Stahuje se soubor
ru: Получение файла

source: Version
cs: Verze
ru: Версия

source: Remote
cs: Vzdálený zdroj

source: Description
cs: Popis
ru: Описание

source: Checksum
cs: Kontrolní součet
ru: Контрольная сумма

source: Choose a release:
cs: Vyberte verzi:
ru: Выберите релиз:

source: %s has firmware updates:
cs: %s má aktualizace firmwaru:
ru: У %s есть обновления микропрограммы:

source: Update Version
cs: Verze aktualizace
ru: Версия обновления

source: Update Remote ID
cs: Vzdálené ID aktualizace
ru: Удалённый ID обновления

source: Update Checksum
cs: Kontrolní součet aktualizace
ru: Контрольная сумма обновления

source: Update Location
cs: Umístění aktualizace
ru: Расположение обновления

source: Update Description
cs: Popis aktualizace
ru: Описание обновления

source: Remote ID
cs: Vzdálené ID
ru: Удалённый ID

source: Title
cs: Název

source: Type
cs: Typ

source: Keyring
cs: Klíčenka

source: Enabled
cs: Povoleno
ru: Включено

source: Age
cs: Věk
ru: Возраст

source: Priority
cs: Priorita
ru: Приоритет

source: Username
cs: Uživatelské jméno
ru: Имя пользователя

source: Password
cs: Heslo
ru: Пароль

source: Filename
cs: Název souboru
ru: Имя файла

source: Filename Signature
cs: Podpis názvu souboru
ru: Подпись имени файла

source: Metadata URI
cs: URI metadat

source: Metadata URI Signature
cs: Podpis URI metadat

source: Firmware Base URI
cs: Základní URI firmwaru

source: Device added:
cs: Přidáno zařízení:
ru: Добавлено устройство:

source: Device removed:
cs: Odebráno zařízení:
ru: Изъято устройство:

source: Device changed:
cs: Změněno zařízení:
ru: Заменено устройство:

source: Show extra debugging information
cs: Zobrazovat doplňující informace pro ladění
ru: Показать дополнительную отладочную информацию

source: Show client and daemon versions
cs: Zobrazit verzi klienta a démonu
ru: Показать версии клиента и демона

source: Schedule installation for next reboot when possible
cs: Pokud je to možné, naplánovat instalaci na příští restart
ru: Планирование установки на следующую перезагрузку, если это возможно

source: Allow re-installing existing firmware versions
cs: Povolit reinstalaci stávající verze firmwaru
ru: Разрешить повторную установку существующих версий микропрограмм

source: Allow downgrading firmware versions
cs: Povolit ponížení verze firmwaru
ru: Разрешить понижение версий микропрограмм

source: Override plugin warning
cs: Potlačit varování zásuvného modulu
ru: Переопределить предупреждение приложения

source: Get all devices that support firmware updates
cs: Zjistit všechna zařízení podporující aktualizaci firmwaru
ru: Получить все устройства, которые поддерживают обновления микропрограммы

source: Return all the hardware IDs for the machine
cs: Vrátit všechna ID hardwaru počítače
ru: Показать ID всех устройств на машине

source: Install prepared updates now
cs: Nainstalovat připravené aktualizace nyní
ru: Установить подготовленные обновления сейчас

source: Install a firmware file on this hardware
cs: Nainstalovat soubor s firmwarem na tento hardware
ru: Установить файл микропрограммы на это оборудование

source: Gets details about a firmware file
cs: Vypsat podrobnosti o souboru s firmwarem
ru: Получает сведения о файле микропрограммы

source: Gets the list of updates for connected hardware
cs: Vypsat seznam aktualizací pro připojený hardware
ru: Получает список обновлений для подключенного оборудования

source: Updates all firmware to latest versions available
cs: Aktualizovat všechen firmware na nejnovější dostupné verze
ru: Обновляет все микропрограммы до их последних доступных версий

source: Gets the cryptographic hash of the dumped firmware
cs: Vypsat kryptografický otisk vypsaného firmwaru
ru: Получает криптографической хэш дампа микропрограммы

source: Unlocks the device for firmware access
cs: Odemknout zařízení pro přístup k firmwaru
ru: Разблокирует устройство для доступа к микропрограмме

source: Clears the results from the last update
cs: Smazat výsledky z poslední aktualizace
ru: Очищает результаты c последнего обновления

source: Clears any updates scheduled to be updated offline
cs: Smazat všechny aktualizace naplánované pro offline aktualizaci

source: Gets the results from the last update
cs: Vypsat výsledky z poslední aktualizace
ru: Получает результаты с последнего обновления

source: Gets the releases for a device
cs: Vypsat vydání pro zařízení
ru: Получает релизы для устройства

source: Gets the configured remotes
cs: Vypsat nastavené vzdálené zdroje

source: Downgrades the firmware on a device
cs: Ponížit verzi firmwaru na zařízení
ru: Скачивает микропрограмму на устройство

source: Refresh metadata from remote server
cs: Aktualizovat metadata ze vzdáleného serveru
ru: Обновить метаданные с удаленного сервера

source: Update the stored metadata with current ROM contents
cs: Aktualizovat uložená metadata pomocí aktuálního obsahu ROM
ru: Обновить хранимые метаданные с текущим содержимым ПЗУ

source: Monitor the daemon for events
cs: Sledovat události démonu
ru: Следить за событиями в фоновой службе

source: Build firmware using a sandbox
cs: Sestavit firmware za použití izolovaného prostředí

source: Dump SMBIOS data from a file
cs: Vypsat SMBIOS data ze souboru

source: Modifies a given remote
cs: Upraví zadaný vzdálený zdroj

source: Firmware Utility
cs: Nástroj pro práci s firmwarem
ru: Средство работы с микропрограммами

source: Synaptics Multistream Transport Utility
ru: Средство многопоточной передачи Synaptics
